/*Створити додаток з допомогою якого можна ввести координати точки (x, y) і визначити, 
чи попадає введена точка в заштриховану область на малюнку, що поданий. Влучення на границю 
області вважати влученням в область.*/

#include<iostream>
#include <cmath>

using namespace std;

int main()
{
    double x, y, r;

    cout << "r = ";
    cin >> r;

    cout << "x = ";
    cin >> x;

    cout << "y = ";
    cin >> y;

    if (x >= 0 && y <= 0 && (pow(x, 2) + pow(y, 2) <= r))
    {
        cout << "Точка є частиною зашрихованої області" << endl;
    }
    else if (x <= 0 && y >= 0 && (abs(x) <= r) && (abs(y) <= r))
    {
        cout << "Точка є частиною зашрихованої області" << endl;
    }
    else
    {
        cout << "Точка не є частиною зашрихованої області" << endl;
    }
    return 0
}
