/*Програму організувати таким чином,щоб користувач міг задавати номер задачі, яку хоче запустити на виконання 
(це можна реалізувати або за допомогою оператора вибору, або безумовного переходу)

1. Вивести на екран всі цілі числа від 𝑎 до 𝑏, кратні деякому числу c. Всі вхідні данні вводяться користувачем з клавіатури. 
2. Написати програму, яка визначає кількість одиниць та двійок у двійковому поданні числа. 
3. Обчислити добуток: D = 1 · (1 + 2) · (1 + 2 + 3) · … · (1 + 2 + … + 9)
*/
#include<iostream>

using namespace std;

int main()
{

    int choice;

    cout << "Оберіть номер задачі: ";
    cin >> choice;

    if (choice == 1)
    {
        int a, b, c, i;

        scanf("%d%d%d", &a, &b, &c);
        for (i = a; i <= b; i++)
            if (i % c == 0)
                printf("%d ", i);
        return 0;
    }

    if (choice == 2)
    {
        unsigned n, no, nz;

        while (cout << "enter a number:\n" && cin >> n && n)
        {
            for (no = 0, nz = 0; n > 0; n >>= 1)
                (n & 1) ? no++ : nz++;
            cout << "1s: " << no << "\n0s: " << nz << endl;
        }
        return 0;
    }

    if (choice == 3)
    {
        float d;
        int i, j;
        int s;

        d = 1;
        for (i = 1; i <= 9; i++) {
            s = 0;
            for (j = 1; j <= i; j++)
                s = s + j;
            d = d * s;
        }
        cout << "d =" << d << endl;

    }
    return 0;
}

